app/views/physicians/show.html.erb


<% @physician.appointments.each do |f| %>
    <%= link_to @patients.find(f.patient_id).name, patient_path(f.patient_id) %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."physician_id" = $1  [["physician_id", 2]]
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]