app/views/patients/show.html.erb

  <% doctor = a.physician_id %>
  <% doctor2 = Physician.find(doctor) %>
---
SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]