app/controllers/appointments_controller.rb

SELECT "patients".* FROM "patients"
---
  def new
    # @test = 0

     @appointment = @physician.appointments.new
     @patients = Patient.all

SELECT "patients".* FROM "patients"
INSERT INTO "appointments" ("appointment_date", "patient_id", "physician_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["appointment_date", "2020-06-17 00:00:00"], ["patient_id", 1], ["physician_id", 14], ["created_at", "2020-06-10 03:53:40.969634"], ["updated_at", "2020-06-10 03:53:40.969634"]]
---
  def create

    # if @test == 0
        @patients = Patient.all
        @appointment = @physician.appointments.new(appointment_params)
        if @appointment.save

SELECT "appointments".* FROM "appointments" WHERE "appointments"."physician_id" = $1 AND "appointments"."id" = $2 LIMIT $3  [["physician_id", 15], ["id", 20], ["LIMIT", 1]]
SELECT "patients".* FROM "patients"
---
  def edit
    @appointment = @physician.appointments.find(params[:id])
    @patients = Patient.all

SELECT "patients".* FROM "patients"
SELECT "appointments".* FROM "appointments" WHERE "appointments"."physician_id" = $1 AND "appointments"."id" = $2 LIMIT $3  [["physician_id", 24], ["id", 93], ["LIMIT", 1]]
UPDATE "appointments" SET "appointment_date" = $1, "patient_id" = $2, "updated_at" = $3 WHERE "appointments"."id" = $4  [["appointment_date", "2020-06-17 00:00:00"], ["patient_id", 15], ["updated_at", "2020-06-11 03:34:36.670780"], ["id", 91]]
---
  def update
    @patients = Patient.all

    @appointment = @physician.appointments.find(params[:id])
    if @appointment.update(appointment_params)

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]
---
  def show
    @appointment = Appointment.find(params[:id])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."physician_id" = $1 AND "appointments"."id" = $2 LIMIT $3  [["physician_id", 25], ["id", 88], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 88]]
---
  def destroy
    @appointment = @physician.appointments.find(params[:id])
    @appointment.destroy

SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
---
  def set_physician
    @physician = Physician.find(params[:physician_id])