app/controllers/patients_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = $1  [["patient_id", 11]]
---
  def show
    @appointments = @patient.appointments.all

INSERT INTO "patients" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Joe"], ["created_at", "2020-06-08 21:55:23.689495"], ["updated_at", "2020-06-08 21:55:23.689495"]]
---
  def create
    @patient = Patient.new(patient_params)
    if @patient.save

DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 40]]
---
  def destroy
    @patient.destroy

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
    def set_patient
      @patient = Patient.find(params[:id])