app/controllers/physicians_controller.rb

SELECT "physicians".* FROM "physicians"
---
  def index
    @physicians = Physician.all

SELECT "patients".* FROM "patients"
---
  def show
    @patients = Patient.all

INSERT INTO "physicians" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asfasd"], ["created_at", "2020-06-08 23:02:17.557386"], ["updated_at", "2020-06-08 23:02:17.557386"]]
---
  def create
    @physician = Physician.new(physician_params)
    if @physician.save

UPDATE "physicians" SET "name" = $1, "updated_at" = $2 WHERE "physicians"."id" = $3  [["name", "Dr. Ms. Latia Windler Jr"], ["updated_at", "2020-06-08 23:02:13.170449"], ["id", 11]]
---
  def update
    if @physician.update(physician_params)

DELETE FROM "physicians" WHERE "physicians"."id" = $1  [["id", 1]]
---
  def destroy
    @physician.destroy

SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
---
    def set_physician
      @physician = Physician.find(params[:id])