app/views/appointments/show.html.erb

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
<h1>Appointment for
<%= (@patients.find(@appointment.patient_id)).name %>

SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---

with <%= (@physicians.find(@appointment.physician_id)).name %>